beaver/grammar/pipeline.dot
    digraph textX {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


133020966114496[ label="{BeaverModel|}"]

133020967748480[ label="{Pipeline|name: ID\loutput_topic: STRING\l}"]

133020965655504[ label="{Data|name: ID\linput_topic: STRING\l}"]

133020965656656[ label="{ProcList|}"]

133020965656800[ label="{Features|keep_features: list[ID]\ldrop_features: list[ID]\ltarget_feature: ID\l}"]

133020965653728[ label="{Assignment|variable: ID\l}"]

133020965653776[ label="{Expression|operators: optional\<list[PlusOrMinus]\>\l}"]

133020965653920[ label="{Term|operators: optional\<list[MulOrDiv]\>\l}"]

133020965654064[ label="{Factor|sign: PlusOrMinus\l}"]

133020966113824[ label="{Operand|op_num: NUMBER\lop_id: ID\l}"]

133020965654208[ label="{Connector|bootstrap_servers: STRING\lsecurity_protocol: STRING\lsasl_username: STRING\lsasl_password: STRING\lquix_sdk_token: STRING\lconsumer_group: STRING\lauto_offset_reset: STRING\lcommit_interval: FLOAT\lcommit_every: INT\lconsumer_poll_timeout: FLOAT\lproducer_poll_timeout: FLOAT\lloglevel: STRING\lauto_create_topics: BOOL\luse_changelog_topics: BOOL\lquix_config_builder: STRING\ltopic_manager: STRING\lrequest_timeout: FLOAT\ltopic_create_timeout: FLOAT\lprocessing_guarantee: STRING\l}"]

133020965654304[ label="{List|}"]

133020965654448[ label="{Tuple|}"]

133020965654736[ label="{Dict|}"]

133020965655456[ label="{DictItem|name: STRING\l}"]

133020965655792[ label="{ModelRef|}"]

133020965656176[ label="{Param|name: ID\l}"]

133020965655984[ label="{*ParamValue|}"]

133020965656848[ label="{*Model|}"]

133020965656560[ label="{*DataModel|}"]

133020965656944[ label="{Feature|name: ID\l}"]

133020965657040[ label="{Composer|name: ID\l}"]

133020965657136[ label="{Preprocessor|name: ID\l}"]

133020965657232[ label="{Algorithm|name: ID\l}"]

133020965657280[ label="{Optimizer|name: ID\l}"]

133020965657376[ label="{Metric|name: ID\l}"]



133020966114496 -> 133020965654208[arrowtail=diamond, dir=both, headlabel="connector "]
133020966114496 -> 133020965656848[arrowtail=diamond, dir=both, headlabel="models 1..*"]
133020966114496 -> 133020965655504[arrowtail=diamond, dir=both, headlabel="data 1..*"]
133020966114496 -> 133020967748480[arrowtail=diamond, dir=both, headlabel="pipelines 1..*"]
133020967748480 -> 133020965655504[headlabel="data "]
133020967748480 -> 133020965657232[headlabel="algorithm "]
133020967748480 -> 133020965657376[headlabel="metrics 1..*"]
133020965655504 -> 133020965656800[arrowtail=diamond, dir=both, headlabel="features "]
133020965655504 -> 133020965656656[arrowtail=diamond, dir=both, headlabel="preprocessors 1..*"]
133020965656656 -> 133020965656560[headlabel="items 1..*"]
133020965656800 -> 133020965653728[arrowtail=diamond, dir=both, headlabel="assignments 0..*"]
133020965653728 -> 133020965653776[arrowtail=diamond, dir=both, headlabel="expression "]
133020965653776 -> 133020965653920[arrowtail=diamond, dir=both, headlabel="operands 0..*"]
133020965653920 -> 133020965654064[arrowtail=diamond, dir=both, headlabel="operands 0..*"]
133020965654064 -> 133020966113824[arrowtail=diamond, dir=both, headlabel="op "]
133020966113824 -> 133020965653776[arrowtail=diamond, dir=both, headlabel="op_expr "]
133020965654304 -> 133020965655984[arrowtail=diamond, dir=both, headlabel="items 0..*"]
133020965654448 -> 133020965655984[arrowtail=diamond, dir=both, headlabel="items 0..*"]
133020965654736 -> 133020965655456[arrowtail=diamond, dir=both, headlabel="items 0..*"]
133020965655456 -> 133020965655984[arrowtail=diamond, dir=both, headlabel="value "]
133020965655792 -> 133020965656848[headlabel="value "]
133020965656176 -> 133020965655984[arrowtail=diamond, dir=both, headlabel="value "]
133020965655984 -> 133020965654448 [dir=back]
133020965655984 -> 133020965654304 [dir=back]
133020965655984 -> 133020965654736 [dir=back]
133020965655984 -> 133020965655792 [dir=back]
133020965656848 -> 133020965657040 [dir=back]
133020965656848 -> 133020965657136 [dir=back]
133020965656848 -> 133020965656944 [dir=back]
133020965656848 -> 133020965657232 [dir=back]
133020965656848 -> 133020965657280 [dir=back]
133020965656848 -> 133020965657376 [dir=back]
133020965656560 -> 133020965657040 [dir=back]
133020965656560 -> 133020965657136 [dir=back]
133020965656560 -> 133020965656944 [dir=back]
133020965656944 -> 133020965656176[arrowtail=diamond, dir=both, headlabel="params 1..*"]
133020965657040 -> 133020965656176[arrowtail=diamond, dir=both, headlabel="params 1..*"]
133020965657136 -> 133020965656176[arrowtail=diamond, dir=both, headlabel="params 1..*"]
133020965657232 -> 133020965656176[arrowtail=diamond, dir=both, headlabel="params 1..*"]
133020965657280 -> 133020965656176[arrowtail=diamond, dir=both, headlabel="params 1..*"]
133020965657376 -> 133020965656176[arrowtail=diamond, dir=both, headlabel="params 1..*"]
match_rules [ shape=plaintext, label=< <table>
	<tr>
		<td><b>MulOrDiv</b></td><td>*|/</td>
	</tr>
	<tr>
		<td><b>PlusOrMinus</b></td><td>+|-</td>
	</tr>
	<tr>
		<td><b>Comment</b></td><td></td>
	</tr>
	<tr>
		<td><b>CommentBlock</b></td><td>\/\*(.|\n)*?\*\/</td>
	</tr>
	<tr>
		<td><b>CommentLine</b></td><td>\/\/.*?$</td>
	</tr>
</table> >]


}
